First/src/Documents/РеализацияТоваровИУслуг/РеализацияТоваровИУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровИУслуг</name>
  <registerRecords>AccumulationRegister.Доходы</registerRecords>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <registerRecords>AccumulationRegister.Товары</registerRecords>
  <registerRecords>AccumulationRegister.Расходы</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСКонтрагентами</registerRecords>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственноеЛицо</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТоварыИУслуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

First/src/Documents/РеализацияТоваровИУслуг/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Функция СуммаПоСтроке(Строка)
	
	
	Строка.Сумма = (Строка.Количество * Строка.Цена) * (100 - Строка.Скидка)/100;
	
	Возврат Строка.Сумма;
	
КонецФункции 

&НаКлиенте
Процедура ПриИзмененииНоменклатуры(ИзмененнаяСтрока)
	
	
	Если ЗначениеЗаполнено(ИзмененнаяСтрока.Номенклатура) Тогда
		ИзмененнаяСтрока.Цена = ЦеныВызовСервера.ЦенаНаДату(ИзмененнаяСтрока.Номенклатура, Объект.Дата);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИзмененнаяСтрока.Номенклатура) Тогда 
		ИзмененнаяСтрока.Скидка = ЦеныВызовСервера.СкидкаНаДату(ИзмененнаяСтрока.Номенклатура, Объект.Дата);
	КонецЕсли;
	
	ПриИзмененииКоличества(ИзмененнаяСтрока);
	ПриИзмененииЦены(ИзмененнаяСтрока);
	ПриИзмененииСтавкиНДС(ИзмененнаяСтрока);
	ИзмененнаяСтрока.СуммаНДС = НДСКлиентСервер.СуммаНДСПоСтавке(ИзмененнаяСтрока);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриИзмененииКоличества(ИзмененнаяСтрока)  
	
	Если ИзмененнаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИзмененнаяСтрока.Сумма = СуммаПоСтроке(ИзмененнаяСтрока);
	
КонецПроцедуры   

&НаКлиенте
Процедура ПриИзмененииЦены(ИзмененнаяСтрока)  
	
	Если ИзмененнаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИзмененнаяСтрока.Сумма = СуммаПоСтроке(ИзмененнаяСтрока);	
КонецПроцедуры  

&НаКлиенте
Процедура ПриИзмененииСкидки(ИзмененнаяСтрока)  
	
	Если ИзмененнаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИзмененнаяСтрока.Сумма = СуммаПоСтроке(ИзмененнаяСтрока);	
КонецПроцедуры  


&НаКлиенте
Процедура ПриИзмененииСуммы(ИзмененнаяСтрока)  
	
	
	Если ИзмененнаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПриИзмененииЦены(ИзмененнаяСтрока);
	ПриИзмененииКоличества(ИзмененнаяСтрока);
	ПриИзмененииСкидки(ИзмененнаяСтрока);
		
	ИзмененнаяСтрока.СуммаНДС = НДСКлиентСервер.СуммаНДСПоСтавке(ИзмененнаяСтрока.Сумма, ИзмененнаяСтрока.СтавкаНДС);
	
КонецПроцедуры    


&НаКлиенте
Процедура ПриИзмененииСтавкиНДС(ИзмененнаяСтрока)  
	
	
	Если ИзмененнаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИзмененнаяСтрока.СуммаНДС = НДСКлиентСервер.СуммаНДСПоСтавке(ИзмененнаяСтрока.Сумма, ИзмененнаяСтрока.СтавкаНДС);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыИУслугиНоменклатураПриИзменении(Элемент)
	ПриИзмененииНоменклатуры(Элементы.ТоварыИУслуги.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыИУслугиКоличествоПриИзменении(Элемент)
	ПриИзмененииКоличества(Элементы.ТоварыИУслуги.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыИУслугиЦенаПриИзменении(Элемент)
	ПриИзмененииЦены(Элементы.ТоварыИУслуги.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыИУслугиСкидкаПриИзменении(Элемент)
	ПриИзмененииСкидки(Элементы.ТоварыИУслуги.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыИУслугиСуммаПриИзменении(Элемент)
	ПриИзмененииСуммы(Элементы.ТоварыИУслуги.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыИУслугиСтавкаНДСПриИзменении(Элемент)
	ПриИзмененииСтавкиНДС(Элементы.ТоварыИУслуги.ТекущиеДанные);
КонецПроцедуры
